{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_16", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "batch_input_shape": [null, 25], "dtype": "float32", "target_shape": [1, 25]}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_35", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_36", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1.0000000116860974e-07, "amsgrad": false}}, "loss": "mse", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_16/forward_lstm_35/kernel", "shape": [25, 512], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_35/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_35/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_35/kernel", "shape": [25, 512], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_35/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_35/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_36/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_36/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_36/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_36/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_36/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_36/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [256, 3], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [3], "dtype": "float32"}]}]}