{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "input_dim": 13266, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/kernel", "shape": [64, 512], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/kernel", "shape": [64, 512], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [256, 4], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [13266, 64], "dtype": "float32"}]}]}